04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/injection/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    phase           air;

    cellZone
    {
        type            containsPoints;
        points          ((0.075 0.2 0.05));
    }

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           0.1;
        duration        5;
        value           1e-3;
    }
}

// ************************************************************************* //
